---
title: "Pandas: Intro to DataFrames"
author: "Mohammed Adil Siraju"
date: "2025-09-16"
categories: [pandas, dataframe]
description: "Understanding basics of Pandas DataFrames, a core data structure for data analysis in Python."
---

DataFrames are the core data structure in pandas for tabular data. This notebook covers creating DataFrames from various sources and basic operations.

You will learn how to:
- Import essential libraries (Pandas, Seaborn, Matplotlib, NumPy)
- Create DataFrames from dictionaries, lists, and NumPy arrays
- View and manipulate DataFrames
- Export DataFrames to CSV and Excel files

## Importing Libraries

Start by importing pandas and other useful libraries for data analysis and visualization.

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

## Creating DataFrames from Dictionaries

DataFrames can be created from Python dictionaries where keys become column names.

In [2]:
data = {'Name': ['Adil', 'Aman', 'Ziya', 'Zahra'],
        'Age': [23,19,15,9],
        'City': ['Matannur','Vellore', 'Tly', 'Knr' ]
        }
data

{'Name': ['Adil', 'Aman', 'Ziya', 'Zahra'],
 'Age': [23, 19, 15, 9],
 'City': ['Matannur', 'Vellore', 'Tly', 'Knr']}

In [3]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   Adil   23  Matannur
1   Aman   19   Vellore
2   Ziya   15       Tly
3  Zahra    9       Knr

## Creating DataFrames from Lists

You can also create DataFrames from lists of lists, specifying column names.

In [4]:
data_list = [ 
    ['Adil', 23, 'Mattanur'],
    ['Aman', 19, 'Vellore'],
    ['Siraj', 55, 'Tly'],
    ['Faritha', 40, 'Chokli']
    ]

data_list

[['Adil', 23, 'Mattanur'],
 ['Aman', 19, 'Vellore'],
 ['Siraj', 55, 'Tly'],
 ['Faritha', 40, 'Chokli']]

In [5]:
df_list = pd.DataFrame(data_list, columns=['Name', 'Age', 'City'])
df_list

      Name  Age      City
0     Adil   23  Mattanur
1     Aman   19   Vellore
2    Siraj   55       Tly
3  Faritha   40    Chokli

## Creating DataFrames from NumPy Arrays

Pandas integrates with NumPy; create DataFrames from arrays with column names.

In [6]:
import numpy as np

In [7]:
data_array = np.array([[1,2,3],
                       [4,5,6],
                       [7,8,9]])

data_array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [8]:
df_array = pd.DataFrame(data_array, columns=['A', 'B', 'C'])
df_array

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

## Exporting DataFrames

Save DataFrames to files like CSV or Excel for sharing or further analysis.

In [9]:
df.to_csv('example.csv', index=False)

In [10]:
df.to_excel('example.xlsx', index=False)

## Best Practices

- Use descriptive column names.
- Check data types with `df.dtypes` after creation.
- Handle missing data appropriately.

## Summary

This notebook introduced creating and exporting DataFrames. DataFrames are versatile for data manipulationâ€”explore more operations next!